<a href="https://colab.research.google.com/github/simsekergun/DATA601/blob/main/Lecture04_Pandas/DATA601_Pandas_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Introduction to Pandas
### What's pandas?
 - Pandas is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. <br>
 - Pandas is part of the Anaconda distribution and can be installed with Anaconda (e.g. <code> conda install pandas </code>) or via pip (<code> pip install pandas</code>) <br>
 - When working with tabular data, such as data stored in spreadsheets or databases, pandas is the right tool (assuming not so large files). <br>
 - Pandas help us to explore, clean, and process our data. <br>
 - In pandas, a data table is called a DataFrame.  <br>
<img src="https://pandas.pydata.org/pandas-docs/stable/_images/01_table_dataframe.svg" width="600">

 - Pandas supports the integration with many file formats or data sources out of the box (csv, excel, sql, json, parquet,…). Importing data from each of these data sources is provided by function with the prefix <span style="color: red;">read_*</span>. Similarly, the <span style="color: red;">to_*</span> methods are used to store data <br> [e.g. <code> sales = pd.read_csv("sales_data.csv" </code>) ] <br>
<img src="https://pandas.pydata.org/pandas-docs/stable/_images/02_io_readwrite.svg" width="800">

Before working with different datasets, let's learn the basics.

<b> Note: </b> Make sure that you have/installed pandas and openpyxl before we proceed. <br>
Once again, you can use the terminal <br>
<code> conda install pandas </code> <br>
and <br>
<code> conda install -c anaconda openpyxl </code> 
<br>
If you don't use conda, then <br>
<code> pip install pandas  </code> <br>
<code> pip install openpyxl </code> 
<br>
<b> Note: </b> We will work on time series / date functionality later. <br>
In the meantime, you can start learning about them at <br>
https://pandas.pydata.org/docs/user_guide/timeseries.html <br>
https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases

In [1]:
import pandas as pd
import numpy as np

### Object Creation

In [2]:
# Creating a Series by passing a list of values, 
# letting pandas create a default integer index:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:
dates = pd.date_range('20220101', periods=6)

In [5]:
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

Let's use dates as our index

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442
2022-01-04  1.687307  0.457700 -1.333244 -1.439628
2022-01-05 -0.567803  1.565118  0.071984  0.268152
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887

In [8]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.
# Note how we create the index and column names
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20220218'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2022-02-18  1.0  3   test  foo
1  1.0 2022-02-18  1.0  3  train  foo
2  1.0 2022-02-18  1.0  3   test  foo
3  1.0 2022-02-18  1.0  3  train  foo

In [10]:
# The columns of the resulting DataFrame have different dtypes.
# Pay attention to columns B, E, ad F!
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Viewing Data

In [11]:
# Here is how to view the top rows of the frame:
df.head()

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442
2022-01-04  1.687307  0.457700 -1.333244 -1.439628
2022-01-05 -0.567803  1.565118  0.071984  0.268152

In [12]:
# or
df.head(3)

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442

In [13]:
# Here is how to view the bottom rows of the frame:
df.tail(2)

                   A         B         C         D
2022-01-05 -0.567803  1.565118  0.071984  0.268152
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887

In [14]:
# Display the index
df.index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
# Display the columns
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
# DataFrame.values gives a NumPy representation of the underlying data
# Note that DataFrame.values does not include the index or column labels in the output
df.values

array([[ 0.2134055 ,  1.30852559,  1.00618822, -0.19580128],
       [ 1.93202973,  1.55402651,  2.3016742 , -1.59235641],
       [-1.65147145,  0.15905921, -0.02231125,  1.10144205],
       [ 1.68730695,  0.45770037, -1.33324388, -1.43962786],
       [-0.56780347,  1.5651183 ,  0.07198418,  0.26815236],
       [-1.85318593, -1.42388907,  1.12738458, -0.34788679]])

In [17]:
# describe() shows a quick statistic summary of your data:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.039953  0.603423  0.525279 -0.367680
std    1.618627  1.153635  1.241678  1.023859
min   -1.853186 -1.423889 -1.333244 -1.592356
25%   -1.380554  0.233720  0.001263 -1.166693
50%   -0.177199  0.883113  0.539086 -0.271844
75%    1.318832  1.492651  1.097085  0.152164
max    1.932030  1.565118  2.301674  1.101442

In [18]:
# Transposing your data:
df.T

   2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
A    0.213405    1.932030   -1.651471    1.687307   -0.567803   -1.853186
B    1.308526    1.554027    0.159059    0.457700    1.565118   -1.423889
C    1.006188    2.301674   -0.022311   -1.333244    0.071984    1.127385
D   -0.195801   -1.592356    1.101442   -1.439628    0.268152   -0.347887

In [19]:
# Sorting by an axis:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-01-01 -0.195801  1.006188  1.308526  0.213405
2022-01-02 -1.592356  2.301674  1.554027  1.932030
2022-01-03  1.101442 -0.022311  0.159059 -1.651471
2022-01-04 -1.439628 -1.333244  0.457700  1.687307
2022-01-05  0.268152  0.071984  1.565118 -0.567803
2022-01-06 -0.347887  1.127385 -1.423889 -1.853186

In [20]:
# Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887
2022-01-03 -1.651471  0.159059 -0.022311  1.101442
2022-01-04  1.687307  0.457700 -1.333244 -1.439628
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-05 -0.567803  1.565118  0.071984  0.268152

In [21]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2022-01-05 -0.567803  1.565118  0.071984  0.268152
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-04  1.687307  0.457700 -1.333244 -1.439628
2022-01-03 -1.651471  0.159059 -0.022311  1.101442
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887

### SELECTION

In [22]:
# Selecting a single column, which yields a Series, equivalent to df.A:
df['A']

2022-01-01    0.213405
2022-01-02    1.932030
2022-01-03   -1.651471
2022-01-04    1.687307
2022-01-05   -0.567803
2022-01-06   -1.853186
Freq: D, Name: A, dtype: float64

In [23]:
df.A

2022-01-01    0.213405
2022-01-02    1.932030
2022-01-03   -1.651471
2022-01-04    1.687307
2022-01-05   -0.567803
2022-01-06   -1.853186
Freq: D, Name: A, dtype: float64

In [24]:
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442

In [25]:
df['20220102':'20220104']

                   A         B         C         D
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442
2022-01-04  1.687307  0.457700 -1.333244 -1.439628

#### Selection by Label

In [26]:
# Remember, we used "dates" as index, e.g. 
# dates = pd.date_range('20220101', periods=6)
# df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

# For getting a cross section using a label:
df.loc[dates[0]]

A    0.213405
B    1.308526
C    1.006188
D   -0.195801
Name: 2022-01-01 00:00:00, dtype: float64

In [27]:
# Selecting on a multi-axis by label:
df.loc[:, ['A', 'B']]

                   A         B
2022-01-01  0.213405  1.308526
2022-01-02  1.932030  1.554027
2022-01-03 -1.651471  0.159059
2022-01-04  1.687307  0.457700
2022-01-05 -0.567803  1.565118
2022-01-06 -1.853186 -1.423889

In [28]:
# Showing label slicing, both endpoints are included:
df.loc['20220102':'20220104', ['A', 'B']]

                   A         B
2022-01-02  1.932030  1.554027
2022-01-03 -1.651471  0.159059
2022-01-04  1.687307  0.457700

In [29]:
# Reduction in the dimensions of the returned object:
df.loc['20220102', ['A', 'B']]

A    1.932030
B    1.554027
Name: 2022-01-02 00:00:00, dtype: float64

In [30]:
# For getting a scalar value:
df.loc[dates[0], 'A']

0.213405496797726

In [31]:
# For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], 'A']

0.213405496797726

#### Selection by Position

In [32]:
# Select via the position of the passed integers:
df.iloc[3]

A    1.687307
B    0.457700
C   -1.333244
D   -1.439628
Name: 2022-01-04 00:00:00, dtype: float64

In [33]:
# By integer slices, acting similar to numpy/python:
df.iloc[3:5, 0:2]

                   A         B
2022-01-04  1.687307  0.457700
2022-01-05 -0.567803  1.565118

In [34]:
# By lists of integer position locations, similar to the numpy/python style:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2022-01-02  1.932030  2.301674
2022-01-03 -1.651471 -0.022311
2022-01-05 -0.567803  0.071984

In [35]:
# For slicing rows explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-03 -1.651471  0.159059 -0.022311  1.101442

In [36]:
# For slicing columns explicitly:
df.iloc[:, 1:3]

                   B         C
2022-01-01  1.308526  1.006188
2022-01-02  1.554027  2.301674
2022-01-03  0.159059 -0.022311
2022-01-04  0.457700 -1.333244
2022-01-05  1.565118  0.071984
2022-01-06 -1.423889  1.127385

In [37]:
# For getting a value explicitly:
df.iloc[1, 1]

1.5540265073299513

In [38]:
# For getting fast access to a scalar (equivalent to the prior method):
# loc: label based indexing
# iloc: position based indexing
# at: works with individuals. label based
# iat: works with individuals. position based
# 
df.iat[1, 1]

1.5540265073299513

### Boolean Indexing

In [39]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188 -0.195801
2022-01-02  1.932030  1.554027  2.301674 -1.592356
2022-01-04  1.687307  0.457700 -1.333244 -1.439628

In [40]:
# Selecting values from a DataFrame where a boolean condition is met
df[df > 0]

                   A         B         C         D
2022-01-01  0.213405  1.308526  1.006188       NaN
2022-01-02  1.932030  1.554027  2.301674       NaN
2022-01-03       NaN  0.159059       NaN  1.101442
2022-01-04  1.687307  0.457700       NaN       NaN
2022-01-05       NaN  1.565118  0.071984  0.268152
2022-01-06       NaN       NaN  1.127385       NaN

In [41]:
# Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2022-01-01  0.213405  1.308526  1.006188 -0.195801    one
2022-01-02  1.932030  1.554027  2.301674 -1.592356    one
2022-01-03 -1.651471  0.159059 -0.022311  1.101442    two
2022-01-04  1.687307  0.457700 -1.333244 -1.439628  three
2022-01-05 -0.567803  1.565118  0.071984  0.268152   four
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887  three

In [42]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2022-01-03 -1.651471  0.159059 -0.022311  1.101442   two
2022-01-05 -0.567803  1.565118  0.071984  0.268152  four

###  Setting
How to add a new column?

In [43]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20220102', periods=6))
s1

2022-01-02    1
2022-01-03    2
2022-01-04    3
2022-01-05    4
2022-01-06    5
2022-01-07    6
Freq: D, dtype: int64

In [44]:
df['F'] = s1

In [45]:
# note that our original index starts at the 1st day of the month
# however s1 starts at the 2nd day of the month
df

                   A         B         C         D    F
2022-01-01  0.213405  1.308526  1.006188 -0.195801  NaN
2022-01-02  1.932030  1.554027  2.301674 -1.592356  1.0
2022-01-03 -1.651471  0.159059 -0.022311  1.101442  2.0
2022-01-04  1.687307  0.457700 -1.333244 -1.439628  3.0
2022-01-05 -0.567803  1.565118  0.071984  0.268152  4.0
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887  5.0

In [46]:
# Setting values by label:
df.at[dates[0], 'A'] = 0
# or df.iat[0, 1] = 0
df

                   A         B         C         D    F
2022-01-01  0.000000  1.308526  1.006188 -0.195801  NaN
2022-01-02  1.932030  1.554027  2.301674 -1.592356  1.0
2022-01-03 -1.651471  0.159059 -0.022311  1.101442  2.0
2022-01-04  1.687307  0.457700 -1.333244 -1.439628  3.0
2022-01-05 -0.567803  1.565118  0.071984  0.268152  4.0
2022-01-06 -1.853186 -1.423889  1.127385 -0.347887  5.0

In [47]:
# Setting by assigning with a NumPy array:
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2022-01-01  0.000000  1.308526  1.006188  5  NaN
2022-01-02  1.932030  1.554027  2.301674  5  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0
2022-01-04  1.687307  0.457700 -1.333244  5  3.0
2022-01-05 -0.567803  1.565118  0.071984  5  4.0
2022-01-06 -1.853186 -1.423889  1.127385  5  5.0

## MISSING DATA
Pandas primarily uses the value np.nan (accronym for Not a Number) to represent missing data. It is by default not included in computations.

In [48]:
# Reindexing allows you to change/add/delete the index on a specified axis. 
# This returns a copy of the data.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.iloc[0,2] = np.NaN
df1

                   A         B         C  D    F   E
2022-01-01  0.000000  1.308526       NaN  5  NaN NaN
2022-01-02  1.932030  1.554027  2.301674  5  1.0 NaN
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0 NaN
2022-01-04  1.687307  0.457700 -1.333244  5  3.0 NaN

In [49]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2022-01-01  0.000000  1.308526       NaN  5  NaN  1.0
2022-01-02  1.932030  1.554027  2.301674  5  1.0  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0  NaN
2022-01-04  1.687307  0.457700 -1.333244  5  3.0  NaN

In [50]:
# To drop any rows that have missing data.
df1.dropna(how='any')
# Note that
# how = 'any' ==> If any NA values are present, drop that row or column.
# how = 'all' ==> If all values are NA, drop that row or column.

                  A         B         C  D    F    E
2022-01-02  1.93203  1.554027  2.301674  5  1.0  1.0

In [51]:
# Drop the columns where at least one element is missing
df1.dropna(axis='columns')

                   A         B  D
2022-01-01  0.000000  1.308526  5
2022-01-02  1.932030  1.554027  5
2022-01-03 -1.651471  0.159059  5
2022-01-04  1.687307  0.457700  5

In [52]:
# Keep only the rows with at least 4 non-NA values.
df1.dropna(thresh=4)
# note that the threshold is not for the number of NaNs
# instead, it is for the number of non-NaNs

                   A         B         C  D    F    E
2022-01-01  0.000000  1.308526       NaN  5  NaN  1.0
2022-01-02  1.932030  1.554027  2.301674  5  1.0  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0  NaN
2022-01-04  1.687307  0.457700 -1.333244  5  3.0  NaN

In [53]:
# To remove the rows, where a specific column has NaNs
df1.dropna(subset=['F'])

                   A         B         C  D    F    E
2022-01-02  1.932030  1.554027  2.301674  5  1.0  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0  NaN
2022-01-04  1.687307  0.457700 -1.333244  5  3.0  NaN

In [54]:
# Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    F    E
2022-01-01  0.000000  1.308526  5.000000  5  5.0  1.0
2022-01-02  1.932030  1.554027  2.301674  5  1.0  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0  5.0
2022-01-04  1.687307  0.457700 -1.333244  5  3.0  5.0

In [55]:
# To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F      E
2022-01-01  False  False   True  False   True  False
2022-01-02  False  False  False  False  False  False
2022-01-03  False  False  False  False  False   True
2022-01-04  False  False  False  False  False   True

In [56]:
df1 # Note that the functions above did not change the df1 dataframe.
# In order to redifine df1 you would need to either use copy or "df1 =" and specified argunment

                   A         B         C  D    F    E
2022-01-01  0.000000  1.308526       NaN  5  NaN  1.0
2022-01-02  1.932030  1.554027  2.301674  5  1.0  1.0
2022-01-03 -1.651471  0.159059 -0.022311  5  2.0  NaN
2022-01-04  1.687307  0.457700 -1.333244  5  3.0  NaN

## Operations

### Statistics

In [57]:
# Performing a descriptive statistic:
# average of columns
df.mean()

A   -0.075521
B    0.603423
C    0.525279
D    5.000000
F    3.000000
dtype: float64

In [58]:
# average of rows (simply by setting axis to 1)
df.mean(1)

2022-01-01    1.828678
2022-01-02    2.357546
2022-01-03    1.097055
2022-01-04    1.762353
2022-01-05    2.013860
2022-01-06    1.570062
Freq: D, dtype: float64

In [59]:
# Operating with objects that have different dimensionality and need alignment. 
# In addition, pandas automatically broadcasts along the specified dimension.
dates = pd.date_range('20220101', periods=6)
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2022-01-01    NaN
2022-01-02    NaN
2022-01-03    1.0
2022-01-04    3.0
2022-01-05    5.0
2022-01-06    NaN
Freq: D, dtype: float64

In [60]:
# Above, when we shift index, 1st of month becomes 3rd, 2nd becomes 4th, etc.
# but since we don't have 7th and 8th in our index, when they are shifted,
# 1st and 2nd elements become NaN

In [61]:
df = pd.DataFrame(np.random.randint(1,11, size=(6, 4)), index=dates, columns=list('ABCD'))
df

            A   B   C   D
2022-01-01  5   8  10   1
2022-01-02  3  10   6   6
2022-01-03  9   8   9  10
2022-01-04  3   8   9   5
2022-01-05  2   9   7   9
2022-01-06  7   5   4   7

In [62]:
s = pd.Series([1, 3, 5, -2, 6, 8], index=dates)

In [63]:
# dataframe.sub: Subtraction of dataframe and other, element-wise (binary operator sub).
df.sub(s, axis='index')

            A   B   C  D
2022-01-01  4   7   9  0
2022-01-02  0   7   3  3
2022-01-03  4   3   4  5
2022-01-04  5  10  11  7
2022-01-05 -4   3   1  3
2022-01-06 -1  -3  -4 -1

### Apply

In [64]:
df

            A   B   C   D
2022-01-01  5   8  10   1
2022-01-02  3  10   6   6
2022-01-03  9   8   9  10
2022-01-04  3   8   9   5
2022-01-05  2   9   7   9
2022-01-06  7   5   4   7

In [65]:
# dataframe.cumsum returns cumulative sum over a DataFrame or Series axis.
# cumulative sum - vertical
df.apply(np.cumsum)

             A   B   C   D
2022-01-01   5   8  10   1
2022-01-02   8  18  16   7
2022-01-03  17  26  25  17
2022-01-04  20  34  34  22
2022-01-05  22  43  41  31
2022-01-06  29  48  45  38

In [66]:
# cumulative sum - horizontal
df.apply(np.cumsum,axis=1)

            A   B   C   D
2022-01-01  5  13  23  24
2022-01-02  3  13  19  25
2022-01-03  9  17  26  36
2022-01-04  3  11  20  25
2022-01-05  2  11  18  27
2022-01-06  7  12  16  23

In [67]:
# finding range manually is also easy
df.apply(lambda x: x.max() - x.min())

A    7
B    5
C    6
D    9
dtype: int64

In [68]:
# finding range of rows
df.T.apply(lambda x: x.max() - x.min())

2022-01-01    9
2022-01-02    7
2022-01-03    2
2022-01-04    6
2022-01-05    7
2022-01-06    3
Freq: D, dtype: int64

In [69]:
# let's do a column-wise operating
df['A'] = df['A'].apply(lambda x: x/10)
df

              A   B   C   D
2022-01-01  0.5   8  10   1
2022-01-02  0.3  10   6   6
2022-01-03  0.9   8   9  10
2022-01-04  0.3   8   9   5
2022-01-05  0.2   9   7   9
2022-01-06  0.7   5   4   7

## MERGING
Pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

#### CONCAT

In [70]:
df = pd.DataFrame(np.random.randint(1,11, size=(6, 6)))
df

   0  1  2   3  4   5
0  1  3  4   9  7   6
1  9  8  9   1  2   7
2  2  1  2   8  4   8
3  3  4  8   5  3   2
4  6  4  5   2  5   7
5  8  5  9  10  5  10

In [71]:
# break it into pieces by rows.
piece1 = df[1:4]
piece2 = df[3:6]
piece1

   0  1  2  3  4  5
1  9  8  9  1  2  7
2  2  1  2  8  4  8
3  3  4  8  5  3  2

In [72]:
piece2

   0  1  2   3  4   5
3  3  4  8   5  3   2
4  6  4  5   2  5   7
5  8  5  9  10  5  10

In [73]:
# First, let's try this
pd.concat([piece1,piece2])

   0  1  2   3  4   5
1  9  8  9   1  2   7
2  2  1  2   8  4   8
3  3  4  8   5  3   2
3  3  4  8   5  3   2
4  6  4  5   2  5   7
5  8  5  9  10  5  10

In [74]:
# Notes that the index 0 does not exist and 3 is repeated. This can cause issues when calling the rows.
# Many ML algorithm outputs new dataframes that depends in the index of another table. 
# reset_index function works on reseting the index.
# The reset_index should be used when dropping rows, merging dataframes and other methods that affect the indexes of a DF.

In [75]:
# Repeating the above ignoring the index. Note that row 0 was dropped in previous step. 
# let's try this now

In [76]:
pd.concat([piece1, piece2], ignore_index=True)

   0  1  2   3  4   5
0  9  8  9   1  2   7
1  2  1  2   8  4   8
2  3  4  8   5  3   2
3  3  4  8   5  3   2
4  6  4  5   2  5   7
5  8  5  9  10  5  10

#### JOIN
SQL style merges

In [77]:
width = pd.DataFrame({'Model': ['Levis501', 'Levis550'], '2020 Sales': [15130, 10232]})
width

      Model  2020 Sales
0  Levis501       15130
1  Levis550       10232

In [78]:
length = pd.DataFrame({'Model': ['Levis501', 'Levis550'], '2021 Sales': [16328, 12034]})
length

      Model  2021 Sales
0  Levis501       16328
1  Levis550       12034

In [79]:
pd.merge(width, length, on='Model')

      Model  2020 Sales  2021 Sales
0  Levis501       15130       16328
1  Levis550       10232       12034

### APPEND

In [80]:
# Append rows to a dataframe
df = pd.DataFrame(np.random.randint(1,10,size=(8, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  3  1  7  3
1  5  6  1  3
2  3  2  7  4
3  9  7  4  7
4  8  5  9  4
5  4  8  6  6
6  4  7  9  1
7  1  9  9  4

In [81]:
# Let's add a row to the end 
# note how we get get the column names of the original df
s = pd.DataFrame(np.random.randint(1,10,size=(1, 4)), columns=df.columns.values)
df.append(s, ignore_index=True)
# Note that .append will be depracated and directs to use .concat.

C:\Users\felix\AppData\Local\Temp\ipykernel_25020\1520251955.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s, ignore_index=True)

   A  B  C  D
0  3  1  7  3
1  5  6  1  3
2  3  2  7  4
3  9  7  4  7
4  8  5  9  4
5  4  8  6  6
6  4  7  9  1
7  1  9  9  4
8  5  3  7  1

## GROUPING

In [82]:
# By “group by” we are referring to a process involving one or more of the following steps:
# (a) Splitting the data into groups based on some criteria
# (b) Applying a function to each group independently
# (c) Combining the results into a data structure

In [83]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randint(1,11,8),
                   'D': np.random.randint(1,11,8)})
df

     A      B  C  D
0  foo    one  7  4
1  bar    one  2  4
2  foo    two  2  6
3  bar  three  2  2
4  foo    two  3  3
5  bar    two  9  1
6  foo    one  8  2
7  foo  three  5  3

In [84]:
# Grouping and then applying the sum() function to the resulting groups.
df.groupby('A').sum()

      C   D
A
bar  13   7
foo  25  18

In [85]:
# Grouping by multiple columns forms a hierarchical index,
# and again we can apply the sum function.
df.groupby(['A', 'B']).sum()

            C  D
A   B
bar one     2  4
    three   2  2
    two     9  1
foo one    15  6
    three   5  3
    two     5  9

### Let's Melt!!
Assume the dataframe below shows the performance of devices (with varying width, length, and thickness) in the last two columns.

How can we transform this dataframe so that it will list the performance of all devices in the following format: 

width, length, thickness, performance

In [86]:
df = pd.DataFrame({'Width': {1: 11, 2: 12, 3: 15},
                   'Length': {1: 1, 2: 3, 3: 5},
                   'Thick_1m': {1: 2, 2: 4, 3: 6},
                   'Thick_2m': {1: 2.5, 2: 4.1, 3: 6.2}})
df

   Width  Length  Thick_1m  Thick_2m
1     11       1         2       2.5
2     12       3         4       4.1
3     15       5         6       6.2

In [87]:
# For this transformation, we need "MELT"
df2 = df.melt(id_vars=["Width", "Length"], 
        var_name="Thickness", 
        value_name="performance").dropna().copy()
df2

   Width  Length Thickness  performance
0     11       1  Thick_1m          2.0
1     12       3  Thick_1m          4.0
2     15       5  Thick_1m          6.0
3     11       1  Thick_2m          2.5
4     12       3  Thick_2m          4.1
5     15       5  Thick_2m          6.2

In [88]:
df2["Thickness"] = df2["Thickness"].str.replace("Thick_","")
df2["Thickness"] = df2["Thickness"].str.replace("m","").astype(float)
df2

   Width  Length  Thickness  performance
0     11       1        1.0          2.0
1     12       3        1.0          4.0
2     15       5        1.0          6.0
3     11       1        2.0          2.5
4     12       3        2.0          4.1
5     15       5        2.0          6.2

## Multi-Indexing

In [89]:
# We want to get a dataframe which will list grad and undergrad student numbers of 4 universities
# Let's create pairs first
list1 = np.repeat(np.asarray(['UMBC', 'UMD', 'Umass','Duke']).T, 2, axis=0).tolist()
list2 = ['Grad', 'Undergrad']*4
tuples = list(zip(*[list1,list2]))
print(tuples)

[('UMBC', 'Grad'), ('UMBC', 'Undergrad'), ('UMD', 'Grad'), ('UMD', 'Undergrad'), ('Umass', 'Grad'), ('Umass', 'Undergrad'), ('Duke', 'Grad'), ('Duke', 'Undergrad')]

In [90]:
index = pd.MultiIndex.from_tuples(tuples, names=['University', 'Type'])
df = pd.DataFrame(np.random.randint(1000,10000, size=(8, 2)), index=index, columns=['Domestic', 'International'])
df

                      Domestic  International
University Type
UMBC       Grad           5909           1019
           Undergrad      4954           3195
UMD        Grad           8165           2885
           Undergrad      9550           3954
Umass      Grad           2963           9844
           Undergrad      4398           4435
Duke       Grad           4825           3433
           Undergrad      9610           3441

In [91]:
df2 = df[:4]
df2

                      Domestic  International
University Type
UMBC       Grad           5909           1019
           Undergrad      4954           3195
UMD        Grad           8165           2885
           Undergrad      9550           3954

In [92]:
df.loc['UMBC']

           Domestic  International
Type
Grad           5909           1019
Undergrad      4954           3195

In [93]:
# Let's get number of students at UMBC
df.loc['UMBC','Grad']

Domestic         5909
International    1019
Name: (UMBC, Grad), dtype: int32

In [94]:
# Let's get number of domestic students at UMBC
df.loc['UMBC','Grad']['Domestic']
# or df.loc['UMBC','Grad'][0]

5909

#### STACK
<b>stack</b> inserts a list into the inner index <br>
<b>melt</b> inserts that list as a new column called 'variable' (can be renamed)

In [95]:
# The stack() method “compresses” a level in the DataFrame’s columns.
stacked = df.stack()
stacked

University  Type
UMBC        Grad       Domestic         5909
                       International    1019
            Undergrad  Domestic         4954
                       International    3195
UMD         Grad       Domestic         8165
                       International    2885
            Undergrad  Domestic         9550
                       International    3954
Umass       Grad       Domestic         2963
                       International    9844
            Undergrad  Domestic         4398
                       International    4435
Duke        Grad       Domestic         4825
                       International    3433
            Undergrad  Domestic         9610
                       International    3441
dtype: int32

In [96]:
# With a “stacked” DataFrame or Series (having a MultiIndex as the index), 
# the inverse operation of stack() is unstack(), which by default unstacks the last level:
stacked.unstack()

                      Domestic  International
University Type
Duke       Grad           4825           3433
           Undergrad      9610           3441
UMBC       Grad           5909           1019
           Undergrad      4954           3195
UMD        Grad           8165           2885
           Undergrad      9550           3954
Umass      Grad           2963           9844
           Undergrad      4398           4435

In [97]:
### Reshaping via unstack
# Watch carefully what happens now!
stacked.unstack(1)

Type                      Grad  Undergrad
University
Duke       Domestic       4825       9610
           International  3433       3441
UMBC       Domestic       5909       4954
           International  1019       3195
UMD        Domestic       8165       9550
           International  2885       3954
Umass      Domestic       2963       4398
           International  9844       4435

In [98]:
# Remember stacked
stacked

University  Type
UMBC        Grad       Domestic         5909
                       International    1019
            Undergrad  Domestic         4954
                       International    3195
UMD         Grad       Domestic         8165
                       International    2885
            Undergrad  Domestic         9550
                       International    3954
Umass       Grad       Domestic         2963
                       International    9844
            Undergrad  Domestic         4398
                       International    4435
Duke        Grad       Domestic         4825
                       International    3433
            Undergrad  Domestic         9610
                       International    3441
dtype: int32

In [99]:
# let's reshape according to the main index
stacked.unstack(0)

University               Duke  UMBC   UMD  Umass
Type
Grad      Domestic       4825  5909  8165   2963
          International  3433  1019  2885   9844
Undergrad Domestic       9610  4954  9550   4398
          International  3441  3195  3954   4435

### PIVOT TABLES

In [100]:
# Let's say we have number of sales for two different products (D and E)
# at four different stores
# by three different managers
# we divide number of sales in two groups: the ones made in week days (M-F)
# and the ones made in weekends (SS)
# managers work either in week days or in weekends but not both
df = pd.DataFrame({'A': ['Store-1', 'Store-2', 'Store-3', 'Store-4'] * 3,
                   'B': ['Manager-1', 'Manager-2', 'Manager-3'] * 4,
                   'C': ['M-F', 'M-F', 'M-F', 'SS', 'SS', 'SS'] * 2,
                   'D': np.random.randint(1,13,12),
                   'E': np.random.randint(1,31,12)})
df

          A          B    C   D   E
0   Store-1  Manager-1  M-F   1   5
1   Store-2  Manager-2  M-F  10   3
2   Store-3  Manager-3  M-F   6   7
3   Store-4  Manager-1   SS   2  22
4   Store-1  Manager-2   SS  10   6
5   Store-2  Manager-3   SS   5   3
6   Store-3  Manager-1  M-F   2   9
7   Store-4  Manager-2  M-F   6  10
8   Store-1  Manager-3  M-F  12  28
9   Store-2  Manager-1   SS   3  27
10  Store-3  Manager-2   SS   3  19
11  Store-4  Manager-3   SS   7  28

In [101]:
# We can produce pivot tables from this data very easily:
# Let's see which manager sold how many "product Ds" in each store
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'],  aggfunc = 'mean')

C                   M-F    SS
A       B
Store-1 Manager-1   1.0   NaN
        Manager-2   NaN  10.0
        Manager-3  12.0   NaN
Store-2 Manager-1   NaN   3.0
        Manager-2  10.0   NaN
        Manager-3   NaN   5.0
Store-3 Manager-1   2.0   NaN
        Manager-2   NaN   3.0
        Manager-3   6.0   NaN
Store-4 Manager-1   NaN   2.0
        Manager-2   6.0   NaN
        Manager-3   NaN   7.0

In [102]:
# Example 2
# Let's say we have number of people 
# as functions of blood type, RH+ or -
# in three towns
df = pd.DataFrame({
    'Type': np.repeat(np.asarray(['A', 'B', 'AB','0']).T, 4, axis=0),
    'RH': [1,-1]*8,
    'M/F': ['Male','Male','Female','Female']*4,
    'D': np.random.randint(10000,20000,16)})

In [103]:
df

   Type  RH     M/F      D
0     A   1    Male  10319
1     A  -1    Male  17273
2     A   1  Female  19768
3     A  -1  Female  19302
4     B   1    Male  10426
5     B  -1    Male  12273
6     B   1  Female  11743
7     B  -1  Female  11741
8    AB   1    Male  18094
9    AB  -1    Male  10544
10   AB   1  Female  16634
11   AB  -1  Female  17044
12    0   1    Male  15283
13    0  -1    Male  19062
14    0   1  Female  19854
15    0  -1  Female  10606

In [104]:
# Let's find out the total number of people 
pd.pivot_table(df,values='D',index=['Type','RH'], columns=['M/F'])

M/F      Female   Male
Type RH
0    -1   10606  19062
      1   19854  15283
A    -1   19302  17273
      1   19768  10319
AB   -1   17044  10544
      1   16634  18094
B    -1   11741  12273
      1   11743  10426

## GETTING DATA IN/OUT

### CSV

In [105]:
# Writing to a csv file
df.to_csv('data601_lecture04.csv')

In [106]:
# Reading from a csv file.
pd.read_csv('data601_lecture04.csv')

    Unnamed: 0 Type  RH     M/F      D
0            0    A   1    Male  10319
1            1    A  -1    Male  17273
2            2    A   1  Female  19768
3            3    A  -1  Female  19302
4            4    B   1    Male  10426
5            5    B  -1    Male  12273
6            6    B   1  Female  11743
7            7    B  -1  Female  11741
8            8   AB   1    Male  18094
9            9   AB  -1    Male  10544
10          10   AB   1  Female  16634
11          11   AB  -1  Female  17044
12          12    0   1    Male  15283
13          13    0  -1    Male  19062
14          14    0   1  Female  19854
15          15    0  -1  Female  10606

### Excel

In [107]:
# Writing to an excel file.
df.to_excel('data601_lecture04.xlsx', sheet_name='Sheet1')
# Note that the encoding when you have text and string data.
# https://stackoverflow.com/questions/15502619/correctly-reading-text-from-windows-1252cp1252-file-in-python
# https://stackoverflow.com/questions/52712201/python-importing-csv-files-in-utf-8-or-cp1252

In [108]:
# Reading from an excel file.
pd.read_excel('data601_lecture04.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

    Unnamed: 0 Type  RH     M/F      D
0            0    A   1    Male  10319
1            1    A  -1    Male  17273
2            2    A   1  Female  19768
3            3    A  -1  Female  19302
4            4    B   1    Male  10426
5            5    B  -1    Male  12273
6            6    B   1  Female  11743
7            7    B  -1  Female  11741
8            8   AB   1    Male  18094
9            9   AB  -1    Male  10544
10          10   AB   1  Female  16634
11          11   AB  -1  Female  17044
12          12    0   1    Male  15283
13          13    0  -1    Male  19062
14          14    0   1  Female  19854
15          15    0  -1  Female  10606

# Notebook End